Revit 2027 API
ParameterTypeId.BendingDetailTypeRadialDimensionTypeId Property
 "Radial Dimension Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BendingDetailTypeRadialDimensionTypeId { get; }
Public Shared ReadOnly Property BendingDetailTypeRadialDimensionTypeId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BendingDetailTypeRadialDimensionTypeId {
	ForgeTypeId^ get ();
}
static member BendingDetailTypeRadialDimensionTypeId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace